[
  {"1": "Title: Initiate a Sourcing Request\n\n\t1.\tQuestion: Do you want to make changes to an existing Contract? (Yes/No)\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\tInstruction:\n\t•\tIf “Yes,” the user needs to indicate the Contract Worker (CW) they want to change.\n\t2.\tSearch Bar:\n\t•\tPrompt:\n\t•\t“Please select the contract you would like to work with”\n\t•\tSearch Criteria:\n\t•\tContract Name\n\t•\tContract ID\n\t•\tThird Party\n\t•\tContract Manager\n\t3.\tAdditional Information:\n\t•\tContract Status:\n\t•\tIf the contract is expired, the user can request an extension/renewal within 1 month after expiry.\n\t•\tIf the contract is in draft amendment status, it must be published first before raising another amendment/extension/renewal.\n\t•\tSupport Contact:\n\t•\tContact Chain IQ or Support Team if needed.\n\t4.\tNavigation:\n\t•\tBack Button\n\t•\tContinue Button (Inactive until selection is made)"},
  {"11": "Title: Chain IQ Involvement\n\n\t1.\tSection: Chain IQ Involvement\n\t•\tInstruction:\n\t•\t“For additional clarity, please refer to the Countries in scope and Category overview.”\n\t•\tNote:\n\t•\t“Countries in scope” = PDF file\n\t•\t“Category overview” = Excel file\n\t2.\tQuestion:\n\t•\t“Can you confirm that Chain IQ will be involved in the process?”\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\tAdditional Field if “No” is selected:\n\t•\tQuestion:\n\t•\t“Reason for not involving Chain IQ”\n\t•\tDropdown Options:\n\t•\tSensitive/Confidential Project\n\t•\tInternal Consulting\n\t•\tBelow CIQ involvement threshold for the category/country not covered by CIQ\n\t•\tTooltip:\n\t•\t“If you say ‘No,’ you need to say why.”\n\t•\t“Sensitive/Confidential” goes directly to the supply chain.\n\t•\t“Below CIQ involvement” goes to the PNSS team.\n\t3.\tExpandable Sections:\n\t•\tSpecify a different Contract Manager\n\t•\tConfirm/Change the Cost Commitment Approvers\n\t•\tBusiness/Budget Owner outside the Contract Manager’s Segment\n\t•\tAttachments"},
  {"12": "Title: Confirm/Change the Cost Commitment Approvers\n\n\t1.\tSection: Confirm/Change the Cost Commitment Approvers\n\t•\tInstruction:\n\t•\t“Approvers are defaulted to the Contract manager reporting line (minimum ranks to meet the policy). These can be changed to another person of the required rank.”\n\t•\tNote:\n\t•\tYou can change the approver, and the list is already filtered for the right seniority.\n\t2.\tFields:\n\t•\tCost Commitment Approver 1\n\t•\tExample: Lardera, Ludovica (43501188)\n\t•\tMinimum Rank: Managing Director\n\t•\tCost Commitment Approver 2\n\t•\tExample: Egger, Harald (00101069)\n\t•\tMinimum Rank: Managing Director\n"},
  {"13": "Title: Business/Budget Owner outside the Contract Manager’s Segment\n\n\t1.\tSection: Business/Budget Owner outside the Contract Manager’s Segment\n\t•\tQuestion:\n\t•\t“Which part of UBS is the business/budget owner?”\n\t2.\tFields:\n\t•\tDivision:\n\t•\tExample: Group Functions\n\t•\tArea:\n\t•\tExample: Group Corporate Services\n\t•\tUnit:\n\t•\tExample: Grp Human Resources & Corporate Services\n\t•\tSector:\n\t•\tExample: Supply Chain\n\t•\tSegment:\n\t•\tExample: Supply Chain (sg)\n\t3.\tSection: Attachments\n\t•\tAllows for adding attachments relevant to the request.\n\t4.\tAdditional Info:\n\t•\tGCRS Info: “The information entered here will drive the business approval.”"},
  {"14": "Title: Attachments\n\n\t1.\tSection: Attachments\n\t•\tPrompt:\n\t•\t“Provide supporting documents for your request.”\n\t2.\tFields:\n\t•\tDescription:\n\t•\tAdd a brief description of what the document relates to.\n\t•\tFile Upload:\n\t•\tDrag and drop a file to attach, or browse to select a file.\n\t3.\tAdd Button:\n\t•\tAdds the attachment to the request.\n"},
  {"31": "Overview - Approval Process\nExplanation:\nPurpose: This screen provides an overview of the approval process for a sourcing request, detailing each step, the responsible owner, status, and completion dates.\nSections:\nDemand Approval:\n\nSubmit Request:\nOwner: Requestor (Locci, Glemo)\nCompletion Date: 13.06.2024\nStatus: Submitted\nCost Commitment Approvals by Finance Policy:\nFirst Cost Commitment Approver: Lardera, Ludovica\nSecond Cost Commitment Approver: Kamm, Adrian\nStatus: Pending\nContracting:\n\nDraft Contract (Supply Chain):\nDraft Contract Upload by Sourcer: Multiple owners, status: Upcoming\nContract Manager Confirmation: Locci, Glemo, status: Upcoming\nRisk Assessments:\n\nPre-contract Risk Checks as Required by TPRM:\nOperational Consolidated Risk Assessment: sh-ocra@ubs.com, status: Not Passed\nLegal Contract Check: Multiple owners, status: Upcoming\nPre-Signature Compliance Check: Multiple owners, status: Upcoming\nContract Approvals:\n\nFinal Contract Reviews and Approvals:\nGSAM Approval: Multiple owners, status: Upcoming\nCommercial Approval: Multiple owners, status: Upcoming\nCommercial Approval Forum (CAF): Multiple owners, status: Upcoming\nOthers: Detailed information not provided in the screenshot.\nDetails:\nProcess Step: Each major phase of the approval process (Demand approval, Contracting, Risk assessments, Contract approvals).\nActivity: Specific actions or tasks within each process step.\nOwner: The individual(s) responsible for completing the activity.\nCompletion Date: The date by which the activity should be completed.\nStatus: The current state of the activity (Submitted, Pending, Upcoming, Not Passed).\nDays: Number of days spent or required for the activity.\nInsights:\nSequential and Parallel Approvals: The process includes both sequential steps and tasks that can be managed in parallel by different owners.\nClear Responsibilities: Each task is assigned to specific individuals or groups, ensuring accountability and clear workflow.\nStatus Tracking: The dashboard allows easy tracking of the progress and current status of each task, aiding in timely follow-ups and completion.\nThis overview provides a comprehensive snapshot of the entire approval process, from the initial request submission to final contract reviews. By detailing the responsible parties and status of each task, it ensures transparency and efficient management of the sourcing request."},
  {"32": "Approver Process Summary\nThe approver process in the UBS sourcing system involves multiple steps and roles to ensure that sourcing requests are thoroughly reviewed and approved in compliance with internal policies and regulatory requirements. Here is a detailed summary of the process:\n\n1. Submit Request\nInitiator: Requestor\nActivity: Submitting the sourcing request.\nCompletion: Requestor completes and submits the initial request form.\nStatus: Submitted\n2. Cost Commitment Approvals\nFirst Cost Commitment Approver\nRole: First-level approver responsible for reviewing the financial aspects of the request.\nApprover Example: Ludovica Lardera\nActivity: Reviewing and approving the cost commitment.\nStatus: Pending or Approved\nSecond Cost Commitment Approver\nRole: Second-level approver, typically with a higher authority or different focus.\nApprover Example: Adrian Kamm\nActivity: Further review and approval of the cost commitment.\nStatus: Pending or Approved\n3. Contracting\nDraft Contract Upload by Sourcer\nInitiator: Sourcer\nActivity: Uploading the draft contract for the sourcing request.\nStatus: Upcoming or Completed\nContract Manager Confirmation\nRole: Contract Manager\nActivity: Confirming the uploaded contract.\nStatus: Upcoming or Confirmed\n4. Risk Assessments\nPre-contract Risk Checks (TPRM)\nRole: Multiple roles, including operational, legal, and compliance teams.\nActivities:\nOperational Consolidated Risk Assessment: Performed by operational risk team.\nLegal Contract Check: Performed by legal team.\nPre-Signature Compliance Check: Performed by compliance team.\nStatus: Not Passed, Upcoming, or Passed\n5. Contract Approvals\nFinal Contract Reviews and Approvals\nRole: Multiple approvers, including GSAM, commercial teams, and other relevant stakeholders.\nActivities:\nGSAM Approval: Review by GSAM team.\nCommercial Approval: Review by commercial team.\nCAF (Commercial Approval Forum) Greater than $100K: Review for high-value contracts.\nOther Stakeholders: As required.\nStatus: Upcoming, Approved, or Rejected\n6. Sourcing Overview\nAssigned Sourcer\nRole: Sourcer\nActivity: Managing the sourcing project following the standard sourcing process.\nStatus: Ongoing\nProject Reference Number\nExample: WS2036130211\nActivity: Tracking the project in the UBS Sourcing Platform.\n7. Final Submission and Approval\nReview of Risk Applicability Summary\nActivity: Ensuring all risk assessments are completed and relevant clauses are included in the contract.\nSubmission of Final Request\nRole: Requestor\nActivity: Submitting the final request for final approval.\nStatus: Submitted\nKey Considerations for Approvers:\nParallel Approvals: Approvers can work in parallel, especially in the cost commitment approval stage, to expedite the process.\nReturning Requests: Approvers can return requests to the requestor for additional information or corrections. This step allows for iterative refinement before final approval.\nCompliance and Risk Management: Each approval step includes checks for compliance with internal policies and regulatory requirements, ensuring all necessary risk assessments are completed.\nNotes and Tips for Faster Approval:\nComplete Documentation: Ensure all required documents and information are included before submission.\nClear Communication: Provide clear and concise information to avoid unnecessary returns and delays.\nFollow Guidance: Utilize provided links and additional guidance to ensure compliance and proper completion of each step.\nMonitor Status: Regularly check the status of the request and follow up with approvers if necessary to keep the process moving.\nThis detailed overview provides a comprehensive understanding of the approver process, ensuring all steps and requirements are clear for efficient and compliant processing of sourcing requests."},
  {"33": "Summary of All Steps:\n1. Initiate a Sourcing Request\nQuestions:\nDo you want to make changes to an existing Contract? (Yes/No)\nSelect the contract to work with.\nAdditional Info:\nContract expiration, extension, and amendment details.\n2. Initiative Description\nFields:\nTitle\nObjectives & Deliverables\nAdditional Info:\nUBS Naming Convention.\n3. What is the type of Good or Service?\nInstructions:\nSelect the appropriate Category.\nSeek advice if needed.\n4. Category Selection Confirmation\nPopup Message:\nImportance of correct category choice.\n5. Deal Financials and Duration\nFields:\nDeal Presenter\nStart Date, End Date\nExpected Amount\nFunding Type, Cost Center, PPM Program Code\nAdditional Info:\nDetails on amount splitting and date selection.\n6. Cost Breakdown\nInstructions:\nSelect spend type, date, and cost.\nClick \"Add.\"\nFields:\nSpend Type\nExpected Delivery Date\nCost\nAdditional Info:\nFrozen amount information.\n7. Integration Budget\nQuestions:\nIs the spend funded out of the integration budget? (Yes/No)\nDo we intend to replace existing technology? (Yes/No)\nFields:\nDuration for Decommission.\n8. AppDir: Application, UBS Products, and Vendor Products\nQuestions:\nDo you know the software you are buying? (Yes/No)\nInstructions:\nSelect the software and register it in the Application directory.\nFields:\nGUID, NAME, or ShortName\nApps or UBS Products\nVendor Product\n9. Chain IQ Involvement\nInstructions:\nRefer to the Countries in scope and Category overview.\nQuestions:\nConfirm Chain IQ involvement? (Yes/No)\nAdditional Field if No:\nReason for not involving Chain IQ.\nExpandable Sections:\nDifferent Contract Manager\nCost Commitment Approvers\nBusiness/Budget Owner outside the Contract Manager's Segment\nAttachments\n10. Confirm/Change the Cost Commitment Approvers\nFields:\nCost Commitment Approver 1\nCost Commitment Approver 2\n11. Business/Budget Owner outside the Contract Manager's Segment\nFields:\nDivision\nArea\nUnit\nSector\nSegment\n12. Attachments\nFields:\nDescription\nFile Upload\n13. Risk Applicability\nSubsections:\nOutsourcing\nRegulatory Outsourcing Control Check (ROCC)\nQuestions on outsourcing categories.\nRegulated Activity / Internal Control Function / Risk Function\nComplexity of outsourced activities.\nQuestions on managed services, cost, and transition time.\nAdditional Outsourcing Questions\nManaged services, costs, and timeframes.\n14. Business Continuity Management (BCM)\nFields:\nBCM Critical\nBCM Tier\nSubsections:\nBusiness Activity and DRP Dependency\nFields: Region, Country, City, Division, Unit, Sector, Area, Business Activities in Scope, Applicable UBS DRP.\nTable with BA ID, Business Activities in Scope, UBS DRP ID, Applicable UBS DRP, Tier, IBS Relevant, Action.\n15. Data Handling\nFields:\nCategory of UBS data (Strictly Confidential, Confidential, Internal, Public/None)\nApplicable categories of data: CID, EID, UPSI.\n16. Information Security (3PISA)\nQuestions:\nIs the service or product provided by the third party supplied solely from UBS premises or an approved Vendor ODC? (Yes/No)\nWill the third party access, transport, store, archive, process or destroy UBS data? (Yes/No)\nWill the service or product involve the use of a third party application or permanent network connectivity to UBS? (Yes/No)\nDoes the service involve XaaS? (Yes/No)\n17. Records Management (RM)\nQuestions:\nWhat is the purpose of the contract and will records be processed?\nWill the request contain the purchase of solely physical goods or supply of a service where no UBS records will be processed? (Yes/No)\nAdditional Questions (if \"No\" is selected):\nSelect the applicable option:\nFinal work product qualifies as record.\nSupply of a service using UBS infrastructure.\nSupply of a service using vendor infrastructure.\nAdditional Info:\nSupport and guidelines for records management.\n18. Intermediary Service\nQuestions:\nWill the vendor act as an Intermediary or provide any Intermediary services on behalf of UBS? (Yes/No)\nDefinition:\nIntermediaries are individuals or entities that provide services which involve interacting, on UBS' behalf, with an external party (e.g., a client, public official), for UBS' benefit or business advantage.\nNote:\nThis section is not segmentation relevant.\n19. Risk Applicability Summary\nDetails:\nRequest ID and Test GL number.\nInstructions:\nReview the data before submitting to avoid repeating steps.\nRisk Assessments to Trigger:\nRegulatory Outsourcing Control Check (ROCC)\nStatus: Yes\nInstructions: Raise a ROCC request or link an existing ROCC to this sourcing request in ServiceNow. Additional guidance provided through a link.\nComplexity of the Service/Contract\nStatus: Medium\nRegulated Activity/Internal Control Function/Risk Function\nStatus: Yes\nBCM Critical (BCM Tier)\nStatus: No\n3PISA Required\nStatus: Yes\nInstructions: Raise a 3PISA request as soon as the vendor is selected. If there is an existing 3PISA assessment covering the requested service, link it to the request later in the process. Further guidance provided through a link.\nOther Service-related Risks to be Considered\nInstructions: Ensure all applicable activities are performed and relevant clauses are included in the contract.\nCID Access\nStatus: Yes\nInstructions: Applicable clauses/exhibits will be included in the contract by Chain IQ. If Chain IQ is not involved, include them yourself. Additional advice provided through guidelines link. 20. Requester Dashboard\nPurpose: View and manage requests.\nFields:\nRequest ID\nDetails\nCategory\nStatus\nApproval steps\n21. Sourcing Overview\nPurpose: Provide an overview of the sourcing process.\nFields:\nSourcing project ID\nAssigned sourcer\nSourcing gates 23. Approver Side - Demand Approval Process\nExplanation:\nPurpose: This screen shows the steps in the demand approval process and the status of each step.\nSections:\nSubmit Request: This is the initial submission of the request.\nCost Commitment Approvals by Finance Policy: The first cost commitment approver reviews and either approves or returns the request.\nForm Change: This indicates any necessary changes or corrections to the form.\nSupply Chain Steps: Subsequent steps handled by the supply chain team.\nDetails:\nProcess Step: Describes the current step in the process.\n\nActivity: Specific actions taken in each process step.\n\nOwner: Person responsible for the action.\n\nCompletion Date: Date when the action was completed.\n\nStatus: Current status of the action, such as \"Returned\" or \"Pending\".\n\nDays: Number of days taken for the step.\n\nReturned Status: Indicates that the request was returned by the approver for further edits. The requester can make the necessary changes and resubmit.\n\nPending Status: Indicates that the request is currently awaiting action.\n\nThe information provided in this step-by-step guide details the submission, approval, and correction process for a sourcing request. Each step is documented with its purpose, action required, and relevant fields, making it easier to understand the workflow and ensure all necessary information is included for a successful submission."},
  {"34": "Detailed Process Breakdown\n1. Initiation:\nUser initiates a request through the chatbot.\nChatbot asks for initial details such as project name, category, and description.\n2. Vendor Product Selection:\nChatbot prompts the user to select vendor products.\nUser provides vendor product details.\n3. Chain IQ Involvement:\nChatbot asks if Chain IQ will be involved.\nBased on the user's response, additional questions may be asked or certain steps skipped.\nIf \"No\": Chatbot asks for the reason for not involving Chain IQ.\nIf \"Yes\": Chatbot proceeds to ask about the contract manager.\n4. Cost Commitment Approvers:\nChatbot requests cost commitment approvers’ details.\nUser provides approver details.\n5. Business/Budget Owner:\nChatbot asks for details about the business/budget owner.\nUser provides the necessary information.\nIf \"Yes\" to outside contract manager's segment: Chatbot asks for the specific business/budget owner.\nIf \"No\": Chatbot proceeds to ask for attachments.\n6. Attachments:\nChatbot prompts the user to attach any relevant documents.\nUser uploads the documents or provides links.\n7. Risk Applicability:\nChatbot guides the user through a series of risk-related questions to determine applicable risk assessments.\nUser responds to questions about outsourcing, data handling, intermediary services, etc.\n8. Review and Submit:\nChatbot reviews all collected information with the user.\nUser confirms and submits the request.\n9. Exception Handling:\nIf the request is returned or a risk assessment fails, the chatbot notifies the user and provides options to correct and resubmit the request.\nUser makes the necessary changes based on the feedback and resubmits.\nUser Guidance and Edge Case Handling\nUncertain Responses:\n\nFor questions where the user might be unsure, the chatbot offers options to select \"I don't know\" and provides additional context or instructions.\nYes/No Decision Points:\n\nEach Yes/No question is followed by tailored prompts to gather additional necessary information or skip irrelevant steps.\nDocument Uploads:\n\nIf the user has documents to upload, the chatbot guides them through the process and confirms successful uploads.\nRisk Assessments:\n\nThe chatbot asks detailed questions about different risk aspects, ensuring all necessary information is captured for each assessment.\nReview and Confirmation:\n\nBefore submission, the chatbot provides a summary of all inputs for the user to review and confirm.\nException Handling:\n\nIn case of exceptions, such as missing information or returned requests, the chatbot clearly communicates the issue, provides instructions for corrections, and allows resubmission." }
]