[
  {"15": "Title: Risk Applicability\n\n\t1.\tSection: Risk Applicability\n\t•\tRequest ID:\n\t•\tExample: Test GL 1306 (Request ID: 365500)\n\t•\tGuidance Links:\n\t•\tROCC, BCM, Records Management, Intermediary Service, Data Handling, 3PISA, Subcontractor\n\t2.\tSubsection: Outsourcing\n\t•\tRegulatory Outsourcing Control Check (ROCC)\n\t•\t“Because you have picked the categories noted below, you are required to complete a risk assessment for Regulatory Outsourcing Control Check.”\n\t•\tTable:\n\t•\tColumns: L1, L2, L3, L4, Outsourcing Relevant\n\t•\tExample Entry: IT Software, Application Service Providers, Yes\n\t3.\tQuestions:\n\t•\t“Does the service fall under any of the following categories that are typically not considered as outsourcing services?”\n\t•\tOptions:\n\t•\tThird Party staff augmentation, staff operating on UBS premises under UBS’s direct supervision and control\n\t•\tRelationships with correspondent banks, agents, and custodians (internal and external)\n\t•\tClearing and settlement arrangements between clearing houses, central counterparties, and settlement institutions and their members\n\t•\tMarket information services (e.g., Bloomberg, Moody’s, Standard & Poor’s) and common network infrastructure (e.g., Visa, Mastercard)\n\t•\tFunctions that are legally required to be performed by external providers (e.g., statutory audit)\n\t•\tPurchasing of goods; facilities management (consisting of the following services: cleaning, gardening, catering, vending, clerical, travel, and premises maintenance, design, and build-out)\n\t•\tLaw firms and consultants providing advice; health insurance\n\t•\tTelecommunication services and public utilities\n\t•\tNone of the above\n\t4.\tAdditional Questions:\n\t•\t“Does the service fall under any of the types of activities that are considered as ineligible for outsourcing as per the TPRM Guideline?”\n\t•\tOptions: Yes, No\n\t5.\tData Inconsistencies Popup:\n\t•\tMessage:\n\t•\t“While the category selected is considered outsourcing relevant, your response indicates that the request includes activities ineligible for outsourcing. Please reach out to the ROCC Support Team for guidance on the inconsistency.”\n\t•\tButtons:\n\t•\tROCC Support Team, Close\n\t•\tTooltip:\n\t•\t“This is a double check; if you flag ‘Yes,’ this pop-up appears.”"},
  {"16": "Title: Regulated Activity / Internal Control Function / Risk Function\n\n\t1.\tSection: Regulated Activity / Internal Control Function / Risk Function\n\t•\tQuestion:\n\t•\t“Does the outsourcing include a regulated activity, parts of a UBS control function or parts of a UBS risk function?”\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\tTooltip:\n\t•\tFollowing questions appear if “No” is selected.\n\t2.\tSection: Complexity of the outsourced activities\n\t•\tInstruction:\n\t•\t“To comply with regulatory requirements, we need to assess the complexity of the outsourced services. As such, please provide responses to the following questions to support the determination of complexity of the outsourcing.”\n\t•\tQuestion:\n\t•\t“Does your initiative involve outsourcing of UBS employees/resources to the vendor only or does it involve also other elements (e.g., IT infrastructure)?”\n\t•\tOptions:\n\t•\tMainly outsourcing of employees\n\t•\tOutsourcing includes other elements as well\n\t•\tQuestion:\n\t•\t“What is the estimated percentage of employees/resources outsourced vs. the total number of employees managing the process and/or retained internally at UBS?”\n\t•\tOptions:\n\t•\t≥ 50%\n\t•\t30-50%\n\t•\t< 30%\n\t•\tTooltip:\n\t•\tThis question is a follow-up to the previous one."},
  {"17": "Additional Outsourcing Questions\n\n\t1.\tQuestion:\n\t•\t“Does the outsourcing involve managed services including transfer of knowledge and/or core capabilities to the service provider?”\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\tOther\n\t2.\tQuestion:\n\t•\t“Will the cost to run the outsourced process and service become a barrier to exit the relationship with the vendor and internalize?”\n\t•\tOptions:\n\t•\tVery likely\n\t•\tLikely\n\t•\tUnlikely\n\t3.\tQuestion:\n\t•\t“Is the estimated cost to insource the service/process (transition/change-the-bank cost) expected to supersede the amount we will pay to the vendor to run the service/process?”\n\t•\tOptions:\n\t•\tTransition cost to insource will be ≥ 3 times the annual vendor fees to provide the service\n\t•\tTransition cost to insource will be 1-3 times the annual vendor fees to provide the service\n\t•\tTransition cost to insource will be < 1 times the annual vendor fees to provide the service\n\t4.\tQuestion:\n\t•\t“How long will it take to internalize the process/service covered by this sourcing request or to transition it to another service provider once it has been outsourced?”\n\t•\tOptions:\n\t•\t≥ 12 months\n\t•\t7-11 months\n\t•\t6 months or less"},
  {"18": "Business Continuity Management (BCM)\n\n\t1.\tSection: Business Continuity Management (BCM)\n\t•\tFields:\n\t•\tBCM Critical: Yes/No\n\t•\tBCM Tier: NA\n\t2.\tSection: Business Activity and DRP Dependency\n\t•\tInstruction:\n\t•\t“Please select all the UBS Business Activities and DRPs that the third party contract will support.”\n\t•\tNote:\n\t•\tDRP = Departmental Recovery Plan\n\t•\tUsers will need help from the BCM team to get clarifications to fill this part of the questionnaire.\n\t3.\tFields:\n\t•\tRegion\n\t•\tCountry\n\t•\tCity\n\t•\tDivision\n\t•\tExample: Group Functions\n\t•\tUnit\n\t•\tExample: Grp Human Resources & Corporate Services\n\t•\tSector\n\t•\tExample: Supply Chain\n\t•\tArea\n\t•\tExample: Group Corporate Services\n\t•\tBusiness Activities in Scope\n\t•\tExample: GCS - Real Estate & Services\n\t•\tApplicable UBS DRP\n\t•\tExample: 19255-DRP-Group Functions-Americas-Grp Human Resources & Corporate Services\n\t4.\tTable:\n\t•\tColumns:\n\t•\tBA ID\n\t•\tBusiness Activities in Scope\n\t•\tUBS DRP ID\n\t•\tApplicable UBS DRP\n\t•\tTier\n\t•\tIBS Relevant\n\t•\tAction\n\t•\tExample Entry:\n\t•\tBA ID: 5332\n\t•\tBusiness Activities in Scope: GCS - Real Estate & Services\n\t•\tUBS DRP ID: 19255\n\t•\tApplicable UBS DRP: Unknown\n\t•\tTier: Tier 3\n\t•\tIBS Relevant: No\n\t5.\tAdditional Information:\n\t•\tInstruction:\n\t•\tUse the GCRS hierarchy filters (Division/Unit/Area, etc.) that the third-party contract supports to find the correct Business Activity (BA) and Departmental Recovery Plan (DRP) as per the UBS Business Continuity Application (BCA) in BCM that the third-party contract supports.\n\t•\tNote:\n\t•\tYou do not have to select all filters, and the filter data will not be stored. However, being more specific will reduce the number of potential BAs and DRPs to choose from."},
  {"19": "Data Handling\n\n\t1.\tSection: Data Handling\n\t•\tInstruction:\n\t•\t“Select the category of UBS data that the vendor/third party is supposed to process, use or otherwise come into possession of.”\n\t•\tDropdown Options:\n\t•\tStrictly Confidential\n\t•\tConfidential\n\t•\tInternal\n\t•\tPublic/None\n\t•\tNote:\n\t•\tDifferent flags appear below depending on the selected item.\n\t2.\tQuestions:\n\t•\t“Select all applicable categories of data which the third party will process (incl. access, handle and/or storage) outside of UBS premises/systems:”\n\t•\tOptions:\n\t•\tClient Identifiable Data (CID)\n\t•\tYes\n\t•\tNo\n\t•\tIf Yes:\n\t•\tType of clients the CID relates to:\n\t•\tIndividual/Natural person clients\n\t•\tInstitutional/Corporate clients\n\t•\tProspective clients\n\t•\tBusiness Division Owning the data:\n\t•\tGroup Functions\n\t•\tWealth Management\n\t•\tWealth Management Americas\n\t•\tPersonal & Corporate Banking\n\t•\tInvestment Bank\n\t•\tAsset Management\n\t•\tCID Type:\n\t•\tCategory A: Direct CID\n\t•\tCategory B: Indirect sensitive IDs for CID\n\t•\tCategory C: Combination of multiple attributes which may result to CID\n\t•\tCategory D: Non-sensitive identifiers (NSI) substituting Category A and/or Category B\n\t•\tEmployee Identifiable Data (EID)\n\t•\tYes\n\t•\tNo\n\t•\tUnpublished Price Sensitive Information (UPSI)\n\t•\tYes\n\t•\tNo\n\t3.\tAdditional Information:\n\t•\tNote:\n\t•\tGuidance in infoboxes and additional links to deep dive.\n\t•\tProvided indicative assessments on the above data points, to the best of your understanding of the scope of your proposed engagement. These data points can be updated once the engagement is final."},
  {"20": "Data Handling (Public/None)\n\n\t1.\tSection: Data Handling\n\t•\tInstruction:\n\t•\t“Select the category of UBS data that the vendor/third party is supposed to process, use or otherwise come into possession of.”\n\t•\tDropdown Options:\n\t•\tStrictly Confidential\n\t•\tConfidential\n\t•\tInternal\n\t•\tPublic/None\n\t•\tNote:\n\t•\tIf “Public/None” is selected, the checkboxes for selecting data categories are disabled.\n\t2.\tQuestions:\n\t•\t“Select all applicable categories of data which the third party will process (incl. access, handle and/or storage) outside of UBS premises/systems:”\n\t•\tOptions:\n\t•\tClient Identifiable Data (CID)\n\t•\tYes (Disabled if “Public/None” is selected)\n\t•\tNo (Disabled if “Public/None” is selected)\n\t•\tEmployee Identifiable Data (EID)\n\t•\tYes (Disabled if “Public/None” is selected)\n\t•\tNo (Disabled if “Public/None” is selected)\n\t•\tUnpublished Price Sensitive Information (UPSI)\n\t•\tYes (Disabled if “Public/None” is selected)\n\t•\tNo (Disabled if “Public/None” is selected)\n\t3.\tAdditional Information:\n\t•\tNote:\n\t•\tProvided indicative assessments on the above data points, to the best of your understanding of the scope of your proposed engagement. These data points can be updated once the engagement is final."},
  {"21": "Information Security (3PISA)\n\n\t1.\tSection: Information Security (3PISA)\n\t•\tNote:\n\t•\t3PISA = Old name of OCRA.\n\t•\tInstruction:\n\t•\tExplanation about data accessibility based on environment control.\n\t2.\tQuestions:\n\t•\t“Is the service or product provided by the third party supplied solely from UBS premises or an approved Vendor ODC?”\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\t“Will the third party access, transport, store, archive, process or destroy UBS data?”\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\t“Will the service or product involve the use of a third party application or permanent network connectivity to UBS?”\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\t“Does the service involve XaaS?”\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\tTooltip:\n\t•\tXaaS: Anything as a Service (e.g., Software as a Service, Infrastructure as a Service)."},
  {"22": "Records Management (RM)\n\n\t1.\tSection: Records Management (RM)\n\t•\tInstruction:\n\t•\t“Please evaluate whether specific records management requirements must be followed when engaging with the vendor by selecting the correct scenario.”\n\t•\tQuestions:\n\t•\t“What is the purpose of the contract and will records be processed?”\n\t•\t“Will the request contain the purchase of solely physical goods or supply of a service where no UBS records will be processed?”\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\tNote:\n\t•\tIf “No” is selected, additional questions appear.\n\t2.\tAdditional Questions (if “No” is selected):\n\t•\t“Please select the applicable option:”\n\t•\tOptions:\n\t•\tFinal work product from the service (e.g., office files, PDF document) qualifies as a record and will be provided to a UBS person.\n\t•\tSupply of a service using UBS infrastructure where UBS records will be created, processed or stored on UBS infrastructure/using UBS software.\n\t•\tSupply of a service using vendor infrastructure. UBS records will be created, processed or stored using vendor’s software.\n\t3.\tAdditional Information:\n\t•\tSupport:\n\t•\tFor further assistance, consult the Records Management Guidelines or watch the video.\n\t•\tWhat qualifies as a Record?\n\t•\tRecords are a subset of information that memorialize and provide objective evidence of activities and transactions performed, events that occurred, results achieved, or statements made.\n\t•\tHow to identify Records?\n\t•\tCASIR is your digital companion for assessing your information asset for mandatory policy requirements. The outcome of CASIR, in combination with your knowledge about the purpose of the contract/service to be provided, will enable you to determine the appropriate scenario.\n\t•\tNote:\n\t•\tRM is not segmentation relevant - within UBS, we segment contracts and the result of the segmentation is (critical - high - medium - low - very low risk)."},
  {"23": "Intermediary Service\n\n\t1.\tSection: Intermediary Service\n\t•\tQuestion:\n\t•\t“Will the vendor act as an Intermediary or provide any Intermediary services on behalf of UBS?”\n\t•\tDefinition:\n\t•\tIntermediaries are individuals or entities that provide services which involve interacting, on UBS’ behalf, with an external party (e.g., a client, public official), for UBS’ benefit or business advantage.\n\t•\tOptions:\n\t•\tYes\n\t•\tNo\n\t•\tNote:\n\t•\tThis section is not segmentation relevant."},
  {"24": "Risk Applicability Summary\n\n\t1.\tSection: Risk Applicability Summary\n\t•\tDetails:\n\t•\tRequest ID and Test GL number.\n\t•\tInstructions:\n\t•\tReview the data before submitting to avoid repeating steps.\n\t2.\tRisk Assessments to Trigger:\n\t•\tRegulatory Outsourcing Control Check (ROCC)\n\t•\tStatus:\n\t•\tYes\n\t•\tInstructions:\n\t•\tRaise a ROCC request or link an existing ROCC to this sourcing request in ServiceNow.\n\t•\tAdditional guidance provided through a link.\n\t•\tComplexity of the Service/Contract\n\t•\tStatus:\n\t•\tMedium\n\t•\tRegulated Activity/Internal Control Function/Risk Function\n\t•\tStatus:\n\t•\tYes\n\t•\tBCM Critical (BCM Tier)\n\t•\tStatus:\n\t•\tNo\n\t•\t3PISA Required\n\t•\tStatus:\n\t•\tYes\n\t•\tInstructions:\n\t•\tRaise a 3PISA request as soon as the vendor is selected.\n\t•\tIf there is an existing 3PISA assessment covering the requested service, link it to the request later in the process.\n\t•\tFurther guidance provided through a link.\n\t•\tOther Service-related Risks to be Considered\n\t•\tInstructions:\n\t•\tEnsure all applicable activities are performed and relevant clauses are included in the contract.\n\t•\tCID Access\n\t•\tStatus:\n\t•\tYes\n\t•\tInstructions:\n\t•\tApplicable clauses/exhibits will be included in the contract by Chain IQ. If Chain IQ is not involved, include them yourself.\n\t•\tAdditional advice provided through guidelines link."},
  {"25": "Risk Applicability Summary (Continuation)\n\n\t1.\tSection: Risk Applicability Summary (Continuation)\n\t•\tDetails:\n\t•\tSummary of various risk assessment fields and their statuses.\n\t2.\tFields:\n\t•\tEID Access\n\t•\tStatus:\n\t•\tYes\n\t•\tInstructions:\n\t•\tApplicable clauses/exhibits will be included in the contract by Chain IQ. If Chain IQ is not involved, include them yourself. Additional advice provided through a link.\n\t•\tPersonal Data\n\t•\tStatus:\n\t•\tYes\n\t•\tUPSI (Unpublished Price Sensitive Information)\n\t•\tStatus:\n\t•\tYes\n\t•\tInstructions:\n\t•\tApplicable clauses/exhibits will be included in the contract by Chain IQ. If Chain IQ is not involved, include them yourself. Additional advice provided through a link.\n\t•\tData Classification\n\t•\tStatus:\n\t•\tInternal\n\t•\tRecords Management\n\t•\tStatus:\n\t•\tNo\n\t•\tIntermediary Service\n\t•\tStatus:\n\t•\tNo\n\t•\tSLA Required\n\t•\tStatus:\n\t•\tYes\n\t•\tInstructions:\n\t•\tAn SLA is required and must be included in the contract by Chain IQ. If Chain IQ is not involved, include them yourself. Refer to the SLA Framework to ensure compliance.\n\t•\tSubcontractor Assessment Required\n\t•\tStatus:\n\t•\tYes\n\t•\tInstructions:\n\t•\tIf Chain IQ is not involved, ask the vendor to fill out the subcontractor questionnaire provided later in the process and upload it.\n\t3.\tActions:\n\t•\tButtons:\n\t•\tSave & Close\n\t•\tEdit\n\t•\tSubmit"},
  {"26": "Risk Applicability Summary\nExplanation:\nPurpose: This screen provides a summary of the risk assessments required for a specific sourcing request (Test GL 1306 with Request ID: 365500). It outlines the different risk checks that need to be initiated and ensures that all relevant clauses are included in the contract.\nSections:\nRisk Assessments to Trigger:\n\nRegulatory Outsourcing Control Check (ROCC):\nStatus: Yes\nAction: Raise a ROCC request or link an existing ROCC to this sourcing request in ServiceNow.\nAdditional Guidance: A link is provided for further guidance on the ROCC process.\nComplexity of the Service/Contract:\n\nComplexity Level: Medium\nRegulated Activity/Internal Control Function/Risk Function:\n\nStatus: Yes\nBCM Critical (BCM Tier):\n\nStatus: No\n3PISA Required:\n\nStatus: Yes\nAction: Raise a 3PISA request as soon as the vendor is selected. If there is already an existing 3PISA assessment covering the requested service, link it to the request later in the process.\nAdditional Guidance: A link is provided for further guidance on the 3PISA process.\nOther Service-Related Risks to Be Considered:\n\nCID Access:\nStatus: Yes\nGuidance: The applicable clauses/exhibits will be included in the contract by Chain IQ. If Chain IQ is not involved, you need to include them yourself.\nPersonal Data:\nStatus: Yes\nUPSI (Unpublished Price Sensitive Information):\nStatus: Yes\nGuidance: The applicable clauses/exhibits will be included in the contract by Chain IQ. If Chain IQ is not involved, you need to include them yourself.\nData Classification:\nStatus: Internal\nRecords Management:\nStatus: No\nIntermediary Service:\nStatus: No\nSLA Required:\nStatus: Yes\nGuidance: An SLA is required and must be included in the contract by Chain IQ. If Chain IQ is not involved, you need to include them yourself.\nSubcontractor Assessment Required:\nStatus: Yes\nGuidance: If Chain IQ is not involved, you need to ask the vendor to fill out the subcontractor questionnaire provided later in the process and upload it.\nInsights:\nComprehensive Risk Assessment: This summary ensures that all necessary risk assessments are identified and actions are outlined to mitigate potential risks.\nGuidance and Links: The inclusion of links and additional guidance provides users with easy access to more detailed information and helps ensure compliance with internal policies.\nStatus Indications: The status (Yes/No) clearly indicates which risk assessments are required, helping users prioritize their actions.\nThis summary is crucial for ensuring that all relevant risk assessments are completed and that the sourcing request complies with regulatory and internal standards. By following the outlined actions and guidance, users can efficiently manage the risk assessment process."},
  {"28": "Approver Side - Demand Approval Process\nExplanation:\nPurpose: This screen shows the steps in the demand approval process and the status of each step.\nSections:\nSubmit Request: This is the initial submission of the request.\nCost Commitment Approvals by Finance Policy: The first cost commitment approver reviews and either approves or returns the request.\nForm Change: This indicates any necessary changes or corrections to the form.\nSupply Chain Steps: Subsequent steps handled by the supply chain team.\nDetails:\nProcess Step: Describes the current step in the process.\n\nActivity: Specific actions taken in each process step.\n\nOwner: Person responsible for the action.\n\nCompletion Date: Date when the action was completed.\n\nStatus: Current status of the action, such as \"Returned\" or \"Pending\".\n\nDays: Number of days taken for the step.\n\nReturned Status: Indicates that the request was returned by the approver for further edits. The requester can make the necessary changes and resubmit.\n\nPending Status: Indicates that the request is currently awaiting action.\n\nThe information provided in this step-by-step guide details the submission, approval, and correction process for a sourcing request. Each step is documented with its purpose, action required, and relevant fields, making it easier to understand the workflow and ensure all necessary information is included for a successful submission.\n\n"},
  {"29": "Approver Dashboard - Overview\nExplanation:\nPurpose: This screen shows the approver's dashboard where they can view and manage requests for approval.\nSections:\nPending: Requests awaiting approval.\nApproved: Requests that have been approved.\nRejected: Requests that have been rejected.\nDetails:\nSearch Bar: Allows the approver to search for specific requests using various filters such as Request ID, Requestor, Type, Category, Approval Step, and Region.\nDownload Table: Provides an option to download the table data as an Excel file for further analysis or record-keeping.\nRequest List: Displays details of each request including:\nRequest ID: Unique identifier for the request.\nRequest Details: Brief description or title of the request.\nL1 Category: High-level category of the request.\nWorkflow Template: Template used for the workflow of the request.\nApproval Step: Current step in the approval process.\nInitiation Date: Date when the request was initiated.\nDays Pending: Number of days the request has been pending.\nRequestor: Person who submitted the request.\nContract Manager: Person responsible for managing the contract.\nInsights:\nPending Requests: Highlighted to show which requests need immediate attention.\nApproval Efficiency: Shows the time taken for each request to be processed, helping to identify bottlenecks.\nFilter Options: Enhances the ability to quickly locate and manage specific requests based on various criteria.\nThis dashboard allows approvers to efficiently manage the approval process by providing a comprehensive overview of all requests. By leveraging the search and filter options, approvers can quickly identify requests that require action and track the status of ongoing approvals."},
  {"30": "Approver View - Cost Commitment Approval\nExplanation:\nPurpose: This screen shows the detailed view for cost commitment approval within the approver dashboard.\nSections:\nCost Commitment: Section where the cost commitment approvals are managed.\nFirst Cost Commitment Approver: Displays the first approver's name, status, and decision options.\nSecond Cost Commitment Approver: Displays the second approver's name, status, and decision options.\nBusiness Approvers: Section for business role-based approvers.\nDetails:\nApproval Type: Indicates the type of approval required (Cost Commitment, Business, etc.).\nApprover: Shows the name and ID of the approver.\nDecision: Dropdown menu for the approver to choose between \"Approve\" and \"Return to Requestor\".\nGeneral Comment: A field for the approver to provide additional comments or feedback related to the approval decision.\nInsights:\nParallel Approvals: Multiple approvers can review and approve the request in parallel, streamlining the approval process.\nDecision Options: Approvers can either approve the request or return it to the requestor for further modifications.\nStage Control: Depending on the stage of the process, a returned request can either go back one step or to the beginning, ensuring thorough review and compliance.\nThis detailed view for cost commitment approval allows approvers to efficiently manage and track their assigned approvals. By having the option to approve or return requests with comments, approvers can ensure that all necessary information and compliance measures are met before proceeding.\n\n"}
]